dependencies/OpenFOAM/modules/OpenQBMM/validation/oneWayCoupledVdfTransportFoam/TaylorGreen/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;
boundaryField
{
    top
    {
        type    cyclic;
    }
    bottom
    {
        type    cyclic;
    }
    left
    {
        type    cyclic;
    }
    right
    {
        type    cyclic;
    }
    front
    {
        type    empty;
    }
    back
    {
        type    empty;
    }
}


// ************************************************************************* //
